app/Controllers/Appointment.php

INSERT INTO `PractitionerSchedule` (`hospital`, `practitionerid`, `appointdate`, `appointtime`, `patientnum`, `fee`) VALUES ('Asiri Hospital-Kandy', 'D0002', '2022-04-18', '10.00am - 12.00pm', '15', 'LKR 3000.00')
---
    public function create()
    {

		$model= new \App\Models\PractitionerScheduleModel;

		$users = new \App\Entities\PractitionerSchedule ($this -> request ->getPost());

		$model->insert($users);