app/Controllers/Register.php

INSERT INTO `User` (`firstname`, `lastname`, `phone`, `email`, `nic`, `address`, `type`, `password`, `approved`) VALUES ('Lara', 'Moses', '+1 (891) 959-3621', 'patient1@gmail.com', '589541467591', 'Et quia eu dignissim', 'Patient', '$2y$10$s3me/dHfiP2nIkyX8thW/O8Ea1vLfZR4t8LYxcuDr8utul40ggQBW', 'No')
---
    public function create()
    {
        $form = $this->request->getPost(); // Gets data from the registration form's post method
        // $validation =  \Config\Services::validation(); // Validation library is loaded

            // get the data from the form
            $email = $this->request->getPost('email');
            $model = new \App\Models\userModel;

            $users = new \App\Entities\User ($this -> request ->getPost());
            $users -> password = password_hash($users->password, PASSWORD_DEFAULT); // Hashes the password
#
            $file = $this->request->getFile('image');
            if ($file->isValid() && !$file->hasMoved()) {
                $imgName= $file->getRandomName();
                $file->move('uploads/',$imgName);
            }

            $model->insert($users);